Config/Documents/РасчетТранспортногоНалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РасчетТранспортногоНалога</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетныйПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОсновныеСредства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвентарныйНомер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнвентарныеНомераОС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НалоговыйОрган</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодПоОКТМО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НалоговаяБаза</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НалоговаяСтавка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>8</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцевВладения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПовышающийКоэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентУменьшения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУменьшения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаИсчислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаАванса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/InformationRegisters/ПаспортаТранспортныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПаспортаТранспортныхСредств</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СерияНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Марка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектов</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектов</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектов</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДвигательМодель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДвигательНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерШасси</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерКузова</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭкологическийКласс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Масса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГаражныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Грузоподъемность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Колонна</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегистрационныйЗнак</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСнятияСУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнвентарныеНомераОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Documents/РасчетТранспортногоНалога/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.РасчетТранспортногоНалога";
	КомандаПечати.Идентификатор		= "Расчет";
	КомандаПечати.Представление		= НСтр("ru = 'Расчет транспортного налога'");
	КомандаПечати.Порядок			= 1;
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов - см. УправлениеПечатьюПереопределяемый.ПриПечати.МассивОбъектов
//  ПараметрыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыПечати
//  КоллекцияПечатныхФорм - см. УправлениеПечатьюПереопределяемый.ПриПечати.КоллекцияПечатныхФорм
//  ОбъектыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
//  ПараметрыВывода - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыВывода
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Расчет") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"Расчет",
			НСтр("ru = 'Расчет транспортного налога'"),
			ПечатьРасчетаТранспортногоНалога(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПечатьРасчетаТранспортногоНалога(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ТолькоПросмотр		= Истина;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПараметрыПечати_РасчетТС";
	
	ОбластиМакета = ОбластиМакетаРасчетТранспортногоНалога();
	ОбщиеСведения = УправлениеПечатьюБГУ.ОбщиеСведенияДокументовДляПечати(МассивОбъектов);
	Результат     = ДанныеРасчета(МассивОбъектов);
	
	ВыборкаДокументов = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Первый = Истина;
	
	Пока ВыборкаДокументов.Следующий() Цикл
		
		Если Не Первый Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		Первый = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ЗначенияЗаполнения = Новый Структура;
		
		УправлениеПечатьюБГУ.ЗаполнитьПараметрыСведенийУчреждения(ЗначенияЗаполнения, ВыборкаДокументов.Ссылка, 
			ОбщиеСведения);

		ЗначенияЗаполнения.Вставить("Номер",
			ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(ВыборкаДокументов.Ссылка, ВыборкаДокументов.Номер));

		СтруктураДаты = ПлатежноРасчетныеДокументы.РазложитьДатуДляПечати(ВыборкаДокументов.Дата);
		ЗначенияЗаполнения.Вставить("Дата",   ВыборкаДокументов.Дата);			
		ЗначенияЗаполнения.Вставить("Дня",    СтруктураДаты.Число);
		ЗначенияЗаполнения.Вставить("Месяца", СтруктураДаты.Месяц);
		ЗначенияЗаполнения.Вставить("Года",   СтруктураДаты.Год);
		
		ГодовойРасчет = (КонецКвартала(ВыборкаДокументов.ОтчетныйПериод) = КонецГода(ВыборкаДокументов.ОтчетныйПериод));
		
		Если ГодовойРасчет Тогда
			
			НачалоПериода      = НачалоГода(ВыборкаДокументов.ОтчетныйПериод);
			ШаблонПериода      = НСтр("ru = 'за налоговый период %1'");
			МесяцевВладения    = НСтр("ru = 'в году/12'");
			ОбластьШапка       = ОбластиМакета.Шапка;
			ОбластьСтрокаОКТМО = ОбластиМакета.СтрокаОКТМО;
			ОбластьСтрокаОС    = ОбластиМакета.СтрокаОС;
			ОбластьИтоги       = ОбластиМакета.Итоги;
		Иначе
				
			НачалоПериода      = НачалоКвартала(ВыборкаДокументов.ОтчетныйПериод);
			ШаблонПериода      = НСтр("ru = 'за отчетный период %1'");
			МесяцевВладения    = НСтр("ru = 'в квартале/3'");
			ОбластьШапка       = ОбластиМакета.ШапкаАванс;
			ОбластьСтрокаОКТМО = ОбластиМакета.СтрокаОКТМОАванс;
			ОбластьСтрокаОС    = ОбластиМакета.СтрокаОСАванс;
			ОбластьИтоги       = ОбластиМакета.ИтогиАванс;
		КонецЕсли;	
		
		ПредставлениеОтчетногоПериода = СтрШаблон(ШаблонПериода,
			ПредставлениеПериода(НачалоПериода, ВыборкаДокументов.ОтчетныйПериод, "ФП = Истина"));
			
		ЗначенияЗаполнения.Вставить("ПредставлениеОтчетногоПериода", ПредставлениеОтчетногоПериода);
		
		ОбластиМакета.Заголовок.Параметры.Заполнить(ЗначенияЗаполнения);		
		ТабличныйДокумент.Вывести(ОбластиМакета.Заголовок);
		
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("МесяцевВладения", МесяцевВладения);
		ОбластьШапка.Параметры.Заполнить(ЗначенияЗаполнения);
		ТабличныйДокумент.Вывести(ОбластьШапка);
		ТабличныйДокумент.НачатьАвтогруппировкуСтрок();
			
		ВыборкаОКТМО = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаОКТМО.Следующий() Цикл
			
			ОбластьСтрокаОКТМО.Параметры.Заполнить(ВыборкаОКТМО);
			ТабличныйДокумент.Вывести(ОбластьСтрокаОКТМО, ВыборкаОКТМО.Уровень());
			ВыборкаОС = ВыборкаОКТМО.Выбрать();
			Пока ВыборкаОС.Следующий() Цикл
				ОбластьСтрокаОС.Параметры.Заполнить(ВыборкаОС);
				ЗначенияЗаполнения = Новый Структура;
				ЗначенияЗаполнения.Вставить("ТекстНалоговойЛьготы", ТекстНалоговойЛьготы(ВыборкаОС));
				ОбластьСтрокаОС.Параметры.Заполнить(ЗначенияЗаполнения);
				ТабличныйДокумент.Вывести(ОбластьСтрокаОС, ВыборкаОС.Уровень());
			КонецЦикла;
		КонецЦикла;
		ТабличныйДокумент.ЗакончитьАвтогруппировкуСтрок();
		
		ОбластьИтоги.Параметры.Заполнить(ВыборкаДокументов);
		ТабличныйДокумент.Вывести(ОбластьИтоги);
		
		СведенияПоДокументу = ОбщиеСведения[ВыборкаДокументов.Ссылка];
		
		ТребуемыеДанные          = "ДолжностьНаименование,НаименованиеПолное";
		ДанныеГлавногоБухгалтера = Справочники.Сотрудники.ДанныеСотрудника(ВыборкаДокументов.ГлавныйБухгалтер, 
			ТребуемыеДанные, ВыборкаДокументов.Дата);
		
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("ДолжностьГлБух",   ДанныеГлавногоБухгалтера.ДолжностьНаименование);
		ФИОГлБух = КорреспондентыКлиентСервер.ФИО(ДанныеГлавногоБухгалтера.НаименованиеПолное);
		ЗначенияЗаполнения.Вставить("ФИОГлБух",         ФИОГлБух);
		ЗначенияЗаполнения.Вставить("Должность",        СведенияПоДокументу.ОтветственныйДолжность);
		ЗначенияЗаполнения.Вставить("ФИО",              СведенияПоДокументу.ОтветственныйФамилияИнициалы);
		ЗначенияЗаполнения.Вставить("НомерТелефона",    СведенияПоДокументу.ОтветственныйТелефон);
		ЗначенияЗаполнения.Вставить("ЭлектроннаяПочта", СведенияПоДокументу.ОтветственныйЭлПочта);
		
		ОбластиМакета.Подписи.Параметры.Заполнить(ЗначенияЗаполнения);
		ТабличныйДокумент.Вывести(ОбластиМакета.Подписи);

		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
			НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументов.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ОбластиМакетаРасчетТранспортногоНалога()
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РасчетТранспортногоНалога.ПФ_MXL_РасчетТранспортногоНалога");
	
	ОбластиМакета = Новый Структура;
	ОбластиМакета.Вставить("Заголовок",        Макет.ПолучитьОбласть("Заголовок"));
	ОбластиМакета.Вставить("Шапка",            Макет.ПолучитьОбласть("Шапка"));
	ОбластиМакета.Вставить("СтрокаОКТМО",      Макет.ПолучитьОбласть("СтрокаОКТМО"));
	ОбластиМакета.Вставить("СтрокаОС",         Макет.ПолучитьОбласть("СтрокаОС"));
	ОбластиМакета.Вставить("Итоги",            Макет.ПолучитьОбласть("Итоги"));
	ОбластиМакета.Вставить("ШапкаАванс",       Макет.ПолучитьОбласть("ШапкаАванс"));
	ОбластиМакета.Вставить("СтрокаОКТМОАванс", Макет.ПолучитьОбласть("СтрокаОКТМОАванс"));
	ОбластиМакета.Вставить("СтрокаОСАванс",    Макет.ПолучитьОбласть("СтрокаОСАванс"));
	ОбластиМакета.Вставить("ИтогиАванс",       Макет.ПолучитьОбласть("ИтогиАванс"));
	ОбластиМакета.Вставить("Подписи",          Макет.ПолучитьОбласть("Подписи"));
	
	Возврат ОбластиМакета;	
КонецФункции

Функция ДанныеРасчета(МассивОбъектов)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТЧОсновныеСредства.Ссылка КАК Ссылка,
	|	ТЧОсновныеСредства.Ссылка.Организация КАК Организация,
	|	ТЧОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТЧОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ТЧОсновныеСредства.НалоговыйОрган.Код КАК КодНО,
	|	ТЧОсновныеСредства.КодПоОКТМО КАК КодПоОКТМО,
	|	ТЧОсновныеСредства.НалоговаяБаза КАК НалоговаяБаза,
	|	ТЧОсновныеСредства.НалоговаяСтавка КАК НалоговаяСтавка,
	|	ТЧОсновныеСредства.МесяцевВладения КАК МесяцевВладения,
	|	ТЧОсновныеСредства.ПовышающийКоэффициент КАК ПовышающийКоэффициент,
	|	ТЧОсновныеСредства.СуммаИсчислено КАК СуммаИсчислено,
	|	ТЧОсновныеСредства.СуммаАванса КАК СуммаАванса,
	|	ТЧОсновныеСредства.Сумма КАК Сумма,
	|	ТЧОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ТЧОсновныеСредства.ПроцентУменьшения КАК ПроцентУменьшения,
	|	ТЧОсновныеСредства.СуммаУменьшения КАК СуммаУменьшения
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.РасчетТранспортногоНалога.ОсновныеСредства КАК ТЧОсновныеСредства
	|ГДЕ
	|	ТЧОсновныеСредства.Ссылка В (&Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПаспортаТранспортныхСредствСрезПоследних.Организация КАК Организация,
	|	ПаспортаТранспортныхСредствСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	ПаспортаТранспортныхСредствСрезПоследних.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ПаспортаТранспортныхСредствСрезПоследних.РегистрационныйЗнак КАК РегистрационныйЗнак
	|ПОМЕСТИТЬ ПТС
	|ИЗ
	|	РегистрСведений.ПаспортаТранспортныхСредств.СрезПоследних(, (Организация, ОсновноеСредство, ИнвентарныйНомер) В
	|		(ВЫБРАТЬ
	|			ВТ.Организация КАК Организация,
	|			ВТ.ОсновноеСредство КАК ОсновноеСредство,
	|			ВТ.ИнвентарныйНомер КАК ИнвентарныйНомер
	|		ИЗ
	|			ВТ КАК ВТ)) КАК ПаспортаТранспортныхСредствСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Ссылка КАК Ссылка,
	|	ВТ.Ссылка.Организация КАК Организация,
	|	ВТ.Ссылка.ОтчетныйПериод КАК ОтчетныйПериод,
	|	ВТ.Ссылка.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
	|	ВТ.Ссылка.Номер КАК Номер,
	|	ВТ.Ссылка.Дата КАК Дата,
	|	ВТ.КодНО КАК КодНО,
	|	ВТ.КодПоОКТМО КАК ОКТМО,
	|	ВТ.ОсновноеСредство КАК ОсновноеСредство,
	|	ВТ.ОсновноеСредство.НаименованиеПолное КАК НаименованиеОС,
	|	ВТ.НалоговаяБаза КАК НалоговаяБаза,
	|	ВТ.НалоговаяСтавка КАК НалоговаяСтавка,
	|	ВТ.МесяцевВладения КАК МесяцевВладения,
	|	ВТ.ПовышающийКоэффициент КАК ПовышающийКоэффициент,
	|	ВТ.СуммаИсчислено КАК СуммаИсчислено,
	|	ВТ.СуммаАванса КАК СуммаАванса,
	|	ВТ.Сумма КАК Сумма,
	|	ЕСТЬNULL(ПТС.РегистрационныйЗнак, """") КАК ГосНомер,
	|	ВТ.ПроцентУменьшения КАК ПроцентУменьшения,
	|	ВТ.СуммаУменьшения КАК СуммаУменьшения
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПТС КАК ПТС
	|		ПО ВТ.Организация = ПТС.Организация
	|		И ВТ.ОсновноеСредство = ПТС.ОсновноеСредство
	|		И ВТ.ИнвентарныйНомер = ПТС.ИнвентарныйНомер
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Ссылка,
	|	ОКТМО,
	|	ВТ.НомерСтроки
	|ИТОГИ
	|	СУММА(Сумма),
	|	СУММА(СуммаИсчислено),
	|	СУММА(СуммаАванса)
	|ПО
	|	Ссылка,
	|	ОКТМО";
	
	Выборка = Запрос.Выполнить();
	
	Возврат Выборка;
	
КонецФункции

Функция ТекстНалоговойЛьготы(Параметры)
	ТекстНалоговойЛьготы = "";
	
	Льготы = Новый Массив;
	Если Параметры.ПроцентУменьшения > 0 Тогда
		ТекстЛьготы = СтрШаблон(НСтр("ru = 'Уменьшение суммы налога на %1%%'"), Параметры.ПроцентУменьшения);
		Льготы.Добавить(ТекстЛьготы);
	КонецЕсли;
	Если Параметры.СуммаУменьшения > 0 Тогда
		ТекстЛьготы = СтрШаблон(НСтр("ru = 'Уменьшение суммы налога на %1 руб.'"), Параметры.СуммаУменьшения);
		Льготы.Добавить(ТекстЛьготы);
	КонецЕсли;
	
	Если Льготы.Количество() > 0 Тогда
		Разделитель = СтрШаблон(НСтр("ru = ';%1'"), Символы.ПС);
		ТекстНалоговойЛьготы = СтрСоединить(Льготы, Разделитель);
	КонецЕсли;
	
	Возврат ТекстНалоговойЛьготы;
КонецФункции

#Область ОбновлениеИнформационнойБазы

// Регистрирует данные к обновлению в плане обмена ОбновлениеИнформационнойБазы.
//
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетТранспортногоНалогаОсновныеСредства.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РасчетТранспортногоНалога.ОсновныеСредства КАК РасчетТранспортногоНалогаОсновныеСредства
	|ГДЕ
	|	РасчетТранспортногоНалогаОсновныеСредства.СуммаИсчислено -
	|		РасчетТранспортногоНалогаОсновныеСредства.СуммаАванса <> РасчетТранспортногоНалогаОсновныеСредства.Сумма";
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

// Обрабатывает данные, зарегистрированные в плане обмена ОбновлениеИнформационнойБазы.
//
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт

	Параметры.ОбработкаЗавершена = Ложь;
	ПолноеИмяОбъекта = "Документ.РасчетТранспортногоНалога";
	Выборка = ОбновлениеИнформационнойБазы.ВыбратьСсылкиДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта);

	Пока Выборка.Следующий() Цикл

		ПредставлениеСсылки = Строка(Выборка.Ссылка);

		НачатьТранзакцию();
		Попытка

			Блокировка = Новый БлокировкаДанных;
			Элемент = Блокировка.Добавить(ПолноеИмяОбъекта);
			Элемент.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			Элемент.Режим = РежимБлокировкиДанных.Исключительный;

			Блокировка.Заблокировать();

			Объект = Выборка.Ссылка.ПолучитьОбъект();

			Если Объект = Неопределено Тогда
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
				ЗафиксироватьТранзакцию();
				Продолжить;
			КонецЕсли;

			ЗаполнитьДобавленныеРеквизитыТабличнойЧасти_2_0_109(Объект);

			Если Объект.Модифицированность() Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
			КонецЕсли;

			ЗафиксироватьТранзакцию();

		Исключение

			ОтменитьТранзакцию();

			ОбновлениеИнформационнойБазы.ЗаписатьОшибкуВЖурналРегистрации(
				Выборка.Ссылка,
				ПредставлениеСсылки,
				ИнформацияОбОшибке());

			ВызватьИсключение;
		КонецПопытки;

	КонецЦикла;

	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь,
		ПолноеИмяОбъекта);

КонецПроцедуры

Процедура ЗаполнитьДобавленныеРеквизитыТабличнойЧасти_2_0_109(Объект)
	
	ГодовойРасчет = КонецДня(Объект.ОтчетныйПериод) = КонецГода(Объект.ОтчетныйПериод);
	Для каждого Строка Из Объект.ОсновныеСредства Цикл
		СуммаИсчислено = Строка.Сумма + ?(ГодовойРасчет, Строка.СуммаАванса, 0);
		Если Строка.СуммаИсчислено <> СуммаИсчислено Тогда
			Строка.СуммаИсчислено = СуммаИсчислено;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
